{"0.0": {"location": "Bag End", "description": "‘It can’t be helped, Sam,’ said Frodo sadly. He had suddenly realized that flying from the Shire would mean more painful partings than merely saying farewell to the familiar comforts of Bag End. ‘I shall have to go. But’ – and here he looked hard at Sam – ‘if you really care about me, you will keep that dead secret. See? If you don’t, if you even breathe a word of what you’ve heard here, then I hope Gandalf will turn you into a spotted toad and fill the garden full of grass-snakes.’{{break}}Sam fell on his knees, trembling. ‘Get up, Sam!’ said Gandalf. ‘I have thought of something better than that. Something to shut your mouth, and punish you properly for listening. You shall go away with Mr. Frodo!’{{break}}‘Me, sir!’ cried Sam, springing up like a dog invited for a walk. ‘Me go and see Elves and all! Hooray!’ he shouted, and then burst into tears.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 62", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/62"}, "5.0": {"location": "Tookland", "description": "After some time they crossed the Water, west of Hobbiton, by a narrow plank-bridge. The stream was there no more than a winding black ribbon, bordered with leaning alder-trees. A mile or two further south they hastily crossed the great road from the Brandywine Bridge; they were now in the Tookland and bending south-eastwards they made for the Green Hill Country. As they began to climb its first slopes they looked back and saw the lamps in Hobbiton far off twinkling in the gentle valley of the Water. Soon it disappeared in the folds of the darkened land, and was followed by Bywater beside its grey pool. When the light of the last farm was far behind, peeping among the trees, Frodo turned and waved a hand in farewell.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 70", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/70"}, "32.0": {"location": "Encounter with Black Rider", "description": "Round the corner came a black horse, no hobbit-pony but a full-sized horse; and on it sat a large man, who seemed to crouch in the saddle, wrapped in a great black cloak and hood, so that only his boots in the high stirrups showed below; his face was shadowed and invisible.{{break}}When it reached the tree and was level with Frodo the horse stopped. The riding figure sat quite still with its head bowed, as if listening. From inside the hood came a noise as of someone sniffing to catch an elusive scent; the head turned from side to side of the road.{{break}}A sudden unreasoning fear of discovery laid hold of Frodo, and he thought of his Ring. He hardly dared to breathe, and yet the desire to get it out of his pocket became so strong that he began slowly to move his hand. He felt that he had only to slip it on, and then he would be safe. The advice of Gandalf seemed absurd. Bilbo had used the Ring. ‘And I am still in the Shire,’ he thought, as his hand touched the chain on which it hung. At that moment the rider sat up, and shook the reins. The horse stepped forward, walking slowly at first, and then breaking into a quick trot.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 73", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/73"}, "41.0": {"location": "Meet the Elves", "description": "The hobbits sat in shadow by the wayside. Before long the Elves came down the lane towards the valley. They passed slowly, and the hobbits could see the starlight glimmering on their hair and in their eyes. They bore no lights, yet as they walked a shimmer, like the light of the moon above the rim of the hills before it rises, seemed to fall about their feet. They were now silent, and as the last Elf passed he turned and looked towards the hobbits and laughed.{{break}}‘Hail, Frodo!’ he cried. ‘You are abroad late. Or are you perhaps lost?’ Then he called aloud to the others, and all the company stopped and gathered round.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 78", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/78"}, "61.0": {"location": "Edge of Farmer Maggot's Field", "description": "Their spirits rose with every step. The line of the River grew nearer; and the Black Riders began to seem like phantoms of the woods now left far behind.{{break}}They passed along the edge of a huge turnip-field, and came to a stout gate. Beyond it a rutted lane ran between low well-laid hedges towards a distant clump of trees. Pippin stopped.{{break}}‘I know these fields and this gate!’ he said. ‘This is Bamfurlong, old Farmer Maggot’s land. That’s his farm away there in the trees.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 89", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/89"}, "70.0": {"location": "Buckleberry Ferry", "description": "They turned down the Ferry lane, which was straight and well-kept and edged with large white-washed stones. In a hundred yards or so it brought them to the river-bank, where there was a broad wooden landing-stage. A large flat ferry-boat was moored beside it. The white bollards near the water’s edge glimmered in the light of two lamps on high posts. Behind them the mists in the flat fields were now above the hedges; but the water before them was dark, with only a few curling wisps like steam among the reeds by the bank. There seemed to be less fog on the further side.{{break}}Merry led the pony over a gangway on to the ferry, and the others followed. Merry then pushed slowly off with a long pole. The Brandywine flowed slow and broad before them. On the other side the bank was steep, and up it a winding path climbed from the further landing. Lamps were twinkling there. Behind loomed up the Buck Hill; and out of it, through stray shrouds of mist, shone many round windows, yellow and red. They were the windows of Brandy Hall, the ancient home of the Brandybucks.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 96", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/96"}, "73.0": {"location": "Crickhollow", "description": "As they walked up the green path from the gate no light was visible; the windows were dark and shuttered. Frodo knocked on the door, and Fatty Bolger opened it. A friendly light streamed out. They slipped in quickly and shut themselves and the light inside. They were in a wide hall with doors on either side; in front of them a passage ran back down the middle of the house.{{break}}‘Well, what do you think of it?’ asked Merry coming up the passage. ‘We have done our best in a short time to make it look like home. After all Fatty and I only got here with the last cart-load yesterday.’{{break}}Frodo looked round. It did look like home. Many of his own favourite things – or Bilbo’s things (they reminded him sharply of him in their new setting) – were arranged as nearly as possible as they had been at Bag End. It was a pleasant, comfortable, welcoming place; and he found himself wishing that he was really coming here to settle down in quiet retirement. It seemed unfair to have put his friends to all this trouble; and he wondered again how he was going to break the news to them that he must leave them so soon, indeed at once. Yet that would have to be done that very night, before they all went to bed.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 98", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/98"}, "95.0": {"location": "Old Man Willow", "description": "They went round to the other side of the tree, and then Sam understood the click that he had heard. Pippin had vanished. The crack by which he had laid himself had closed together, so that not a chink could be seen. Merry was trapped: another crack had closed about his waist; his legs lay outside, but the rest of him was inside a dark opening, the edges of which gripped like a pair of pincers.{{break}}Frodo and Sam beat first upon the tree-trunk where Pippin had lain. They then struggled frantically to pull open the jaws of the crack that held poor Merry. It was quite useless.{{break}}‘What a foul thing to happen!’ cried Frodo wildly. ‘Why did we ever come into this dreadful Forest? I wish we were all back at Crickhollow!’ He kicked the tree with all his strength, heedless of his own feet. A hardly perceptible shiver ran through the stem and up into the branches; the leaves rustled and whispered, but with a sound now of faint and far-off laughter.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 115", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/115"}, "98.0": {"location": "Tom Bombadil's House", "description": "A door opened and in came Tom Bombadil. He had now no hat and his thick brown hair was crowned with autumn leaves. He laughed, and going to Goldberry, took her hand.{{break}}‘Here’s my pretty lady!’ he said, bowing to the hobbits. ‘Here’s my Goldberry clothed all in silver-green with flowers in her girdle! Is the table laden? I see yellow cream and honeycomb, and white bread, and butter; milk, cheese, and green herbs and ripe berries gathered. Is that enough for us? Is the supper ready?’{{break}}‘It is,’ said Goldberry; ‘but the guests perhaps are not?’{{break}}Tom clapped his hands and cried: ‘Tom, Tom! your guests are tired, and you had near forgotten! Come now, my merry friends, and Tom will refresh you! You shall clean grimy hands, and wash your weary faces; cast off your muddy cloaks and comb out your tangles!’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 122", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/122"}, "115.0": {"location": "Captured by Barrow Wight", "description": "At first Frodo felt as if he had indeed been turned into stone by the incantation. Then a wild thought of escape came to him. He wondered if he put on the Ring, whether the Barrow-wight would miss him, and he might find some way out. He thought of himself running free over the grass, grieving for Merry, and Sam, and Pippin, but free and alive himself. Gandalf would admit that there had been nothing else he could do.{{break}}But the courage that had been awakened in him was now too strong: he could not leave his friends so easily. He wavered, groping in his pocket, and then fought with himself again; and as he did so the arm crept nearer. Suddenly resolve hardened in him, and he seized a short sword that lay beside him, and kneeling he stooped low over the bodies of his companions. With what strength he had he hewed at the crawling arm near the wrist, and the hand broke off; but at the same moment the sword splintered up to the hilt. There was a shriek and the light vanished. In the dark there was a snarling noise.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 138", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/138"}, "135.0": {"location": "Bree", "description": "It was dark, and white stars were shining, when Frodo and his companions came at last to the Greenway-crossing and drew near the village. They came to the West-gate and found it shut; but at the door of the lodge beyond it, there was a man sitting. He jumped up and fetched a lantern and looked over the gate at them in surprise.{{break}}‘What do you want, and where do you come from?’ he asked gruffly.{{break}}‘We are making for the inn here,’ answered Frodo. ‘We are journeying east and cannot go further tonight.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 148", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/148"}, "173.0": {"location": "Midgewater Marshes (West)", "description": "The ground now became damp, and in places boggy and here and there they came upon pools, and wide stretches of reeds and rushes filled with the warbling of little hidden birds. They had to pick their way carefully to keep both dry-footed and on their proper course. At first they made fair progress, but as they went on, their passage became slower and more dangerous. The marshes were bewildering and treacherous, and there was no permanent trail even for Rangers to find through their shifting quagmires. The flies began to torment them, and the air was full of clouds of tiny midges that crept up their sleeves and breeches and into their hair.{{break}}‘I am being eaten alive!’ cried Pippin. ‘Midgewater! There are more midges than water!’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 178", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/178"}, "198.0": {"location": "Midgewater Marshes (East)", "description": "They had not gone far on the fifth day when they left the last straggling pools and reed-beds of the marshes behind them. The land before them began steadily to rise again. Away in the distance eastward they could now see a line of hills. The highest of them was at the right of the line and a little separated from the others. It had a conical top, slightly flattened at the summit.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 179", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/179"}, "240.0": {"location": "Weathertop", "description": "They stood for a while silent on the hill-top, near its southward edge. In that lonely place Frodo for the first time fully realized his homelessness and danger. He wished bitterly that his fortune had left him in the quiet and beloved Shire. He stared down at the hateful Road, leading back westward – to his home. Suddenly he was aware that two black specks were moving slowly along it, going westward; and looking again he saw that three others were creeping eastward to meet them. He gave a cry and clutched Strider’s arm.{{break}}‘Look,’ he said, pointing downwards.{{break}}At once Strider flung himself on the ground behind the ruined circle, pulling Frodo down beside him. Merry threw himself alongside.{{break}}‘What is it?’ he whispered.{{break}}‘I do not know, but I fear the worst,’ answered Strider.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 183", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/183"}, "298.0": {"location": "3 Days after Weathertop", "description": "They dreaded the dark hours, and kept watch in pairs by night, expecting at any time to see black shapes stalking in the grey night, dimly lit by the cloud-veiled moon; but they saw nothing, and heard no sound but the sigh of withered leaves and grass. Not once did they feel the sense of present evil that had assailed them before the attack in the dell. It seemed too much to hope that the Riders had already lost their trail again. Perhaps they were waiting to make some ambush in a narrow place?", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 195", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/195"}, "359.0": {"location": "Trollshaws", "description": "The hobbits were glad to leave the cheerless lands and the perilous Road behind them; but this new country seemed threatening and unfriendly. As they went forward the hills about them steadily rose. Here and there upon heights and ridges they caught glimpses of ancient walls of stone, and the ruins of towers: they had an ominous look. Frodo, who was not walking, had time to gaze ahead and to think. He recalled Bilbo’s account of his journey and the threatening towers on the hills north of the Road, in the country near the Trolls’ wood where his first serious adventure had happened. Frodo guessed that they were now in the same region, and wondered if by chance they would pass near the spot.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 196", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/196"}, "393.0": {"location": "Mr. Bilbo's Trolls", "description": "They halted suddenly on the edge, and peered through the tree-trunks, holding their breath.{{break}}There stood the trolls: three large trolls. One was stooping, and the other two stood staring at him.{{break}}Strider walked forward unconcernedly. ‘Get up, old stone!’ he said, and broke his stick upon the stooping troll.{{break}}Nothing happened. There was a gasp of astonishment from the hobbits, and then even Frodo laughed. ‘Well!’ he said. ‘We are forgetting our family history! These must be the very three that were caught by Gandalf, quarrelling over the right way to cook thirteen dwarves and one hobbit.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 200", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/200"}, "405.0": {"location": "Meet Glorfindel", "description": "Strider sprang from hiding and dashed down towards the Road, leaping with a cry through the heather; but even before he had moved or called, the rider had reined in his horse and halted, looking up towards the thicket where they stood. When he saw Strider, he dismounted and ran to meet him calling out: Ai na vedui Dúnadan! Mae govannen! His speech and clear ringing voice left no doubt in their hearts: the rider was of the Elven-folk. No others that dwelt in the wide world had voices so fair to hear. But there seemed to be a note of haste or fear in his call, and they saw that he was now speaking quickly and urgently to Strider.{{break}}Soon Strider beckoned to them, and the hobbits left the bushes and hurried down to the Road. ‘This is Glorfindel, who dwells in the house of Elrond,’ said Strider.{{break}}‘Hail, and well met at last!’ said the Elf-lord to Frodo. ‘I was sent from Rivendell to look for you. We feared that you were in danger upon the road.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 204", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/204"}, "450.0": {"location": "Ford of Bruinen", "description": "Frodo looked back for a moment over his shoulder. He could no longer see his friends. The Riders behind were falling back: even their great steeds were no match in speed for the white elf-horse of Glorfindel. He looked forward again, and hope faded. There seemed no chance of reaching the Ford before he was cut off by the others that had lain in ambush. He could see them clearly now: they appeared to have cast aside their hoods and black cloaks, and they were robed in white and grey. Swords were naked in their pale hands; helms were on their heads. Their cold eyes glittered, and they called to him with fell voices.{{break}}Fear now filled all Frodo’s mind. He thought no longer of his sword. No cry came from him. He shut his eyes and clung to the horse’s mane. The wind whistled in his ears, and the bells upon the harness rang wild and shrill. A breath of deadly cold pierced him like a spear, as with a last spurt, like a flash of white fire, the elf-horse speeding as if on wings, passed right before the face of the foremost Rider.{{break}}Frodo heard the splash of water. It foamed about his feet. He felt the quick heave and surge as the horse left the river and struggled up the stony path. He was climbing the steep bank. He was across the Ford.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 208", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/208"}, "458.0": {"location": "Rivendell", "description": "The face of Elrond was ageless, neither old nor young, though in it was written the memory of many things both glad and sorrowful. His hair was dark as the shadows of twilight, and upon it was set a circlet of silver; his eyes were grey as a clear evening, and in them was a light like the light of stars. Venerable he seemed as a king crowned with many winters, and yet hale as a tried warrior in the fulness of his strength. He was the Lord of Rivendell and mighty among both Elves and Men.{{break}}In the middle of the table, against the woven cloths upon the wall, there was a chair under a canopy, and there sat a lady fair to look upon, and so like was she in form of womanhood to Elrond that Frodo guessed that she was one of his close kindred. Young she was and yet not so. The braids of her dark hair were touched by no frost; her white arms and clear face were flawless and smooth, and the light of stars was in her bright eyes, grey as a cloudless night; yet queenly she looked, and thought and knowledge were in her glance, as of one who has known many things that the years bring. Above her brow her head was covered with a cap of silver lace netted with small gems, glittering white; but her soft grey raiment had no ornament save a girdle of leaves wrought in silver.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 220", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/220"}, "466.0": {"location": "Ford of Bruinen", "description": "They crossed the bridge and wound slowly up the long steep paths that led out of the cloven vale of Rivendell; and they came at length to the high moor where the wind hissed through the heather. Then with one glance at the Last Homely House twinkling below them they strode away far into the night.{{break}}At the Ford of Bruinen they left the Road and turning southwards went on by narrow paths among the folded lands. Their purpose was to hold this course west of the Mountains for many miles and days. The country was much rougher and more barren than in the green vale of the Great River in Wilderland on the other side of the range, and their going would be slow; but they hoped in this way to escape the notice of unfriendly eyes. The spies of Sauron had hitherto seldom been seen in this empty country, and the paths were little known except to the people of Rivendell.{{break}}Gandalf walked in front, and with him went Aragorn, who knew this land even in the dark. The others were in file behind, and Legolas whose eyes were keen was the rearguard.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 274", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/274"}, "484.0": {"location": "Cross a small stream", "description": "@TODO - can't find reference for this, remove?", "reference": "", "link": ""}, "510.0": {"location": "3 Days after Rivendell", "description": "The first part of their journey was hard and dreary, and Frodo remembered little of it, save the wind. For many sunless days an icy blast came from the Mountains in the east, and no garment seemed able to keep out its searching fingers.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 274", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/274"}, "555.0": {"location": "6 Days after Rivendell", "description": "Though the Company was well clad, they seldom felt warm, either moving or at rest. They slept uneasily during the middle of the day, in some hollow of the land, or hidden under the tangled thorn-bushes that grew in thickets in many places. In the late afternoon they were roused by the watch, and took their chief meal: cold and cheerless as a rule, for they could seldom risk the lighting of a fire. In the evening they went on again, always as nearly southward as they could find a way.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 274", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/274"}, "600.0": {"location": "9 Days after Rivendell", "description": "Each day the land looked much the same as it had the day before. Yet steadily the mountains were drawing nearer. South of Rivendell they rose ever higher, and bent westwards; and about the feet of the main range there was tumbled an ever wider land of bleak hills, and deep valleys filled with turbulent waters. Paths were few and winding, and led them often only to the edge of some sheer fall, or down into treacherous swamps.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 275", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/275"}, "645.0": {"location": "12 Days after Rivendell", "description": "They had been a fortnight on the way when the weather changed. The wind suddenly fell and then veered round to the south. The swift-flowing clouds lifted and melted away, and the sun came out, pale and bright. There came a cold clear dawn at the end of a long stumbling night-march. The travellers reached a low ridge crowned with ancient holly-trees whose grey-green trunks seemed to have been built out of the very stone of the hills. Their dark leaves shone and their berries glowed red in the light of the rising sun.{{break}}Away in the south Frodo could see the dim shapes of lofty mountains that seemed now to stand across the path that the Company was taking. At the left of this high range rose three peaks; the tallest and nearest stood up like a tooth tipped with snow; its great, bare, northern precipice was still largely in the shadow, but where the sunlight slanted upon it, it glowed red.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 275", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/275"}, "690.0": {"location": "Hollin Ridge", "description": "‘Lie flat and still!’ hissed Aragorn, pulling Sam down into the shade of a holly-bush; for a whole regiment of birds had broken away suddenly from the main host, and came, flying low, straight towards the ridge. Sam thought they were a kind of crow of large size. As they passed overhead, in so dense a throng that their shadow followed them darkly over the ground below, one harsh croak was heard.{{break}}Not until they had dwindled into the distance, north and west, and the sky was again clear would Aragorn rise. Then he sprang up and went and wakened Gandalf.{{break}}‘Regiments of black crows are flying over all the land between the Mountains and the Greyflood,’ he said, ‘and they have passed over Hollin. They are not natives here; they are crebain out of Fangorn and Dunland. I do not know what they are about: possibly there is some trouble away south from which they are fleeing; but I think they are spying out the land. I have also glimpsed many hawks flying high up in the sky. I think we ought to move again this evening. Hollin is no longer wholesome for us: it is being watched.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 277", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/277"}, "750.0": {"location": "Redhorn Pass", "description": "Frodo’s legs ached. He was chilled to the bone and hungry; and his head was dizzy as he thought of the long and painful march downhill. Black specks swam before his eyes. He rubbed them, but the black specks remained. In the distance below him, but still high above the lower foothills, dark dots were circling in the air.{{break}}‘The birds again!’ said Aragorn, pointing down.{{break}}‘That cannot be helped now,’ said Gandalf. ‘Whether they are good or evil, or have nothing to do with us at all, we must go down at once. Not even on the knees of Caradhras will we wait for another night-fall!’{{break}}A cold wind flowed down behind them, as they turned their backs on the Redhorn Gate, and stumbled wearily down the slope. Caradhras had defeated them.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 286", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/286"}, "778.0": {"location": "Attack by Wargs", "description": "The night was old, and westward the waning moon was setting, gleaming fitfully through the breaking clouds. Suddenly Frodo started from sleep. Without warning a storm of howls broke out fierce and wild all about the camp. A great host of Wargs had gathered silently and was now attacking them from every side at once.{{break}}‘Fling fuel on the fire!’ cried Gandalf to the hobbits. ‘Draw your blades, and stand back to back!’{{break}}In the leaping light, as the fresh wood blazed up, Frodo saw many grey shapes spring over the ring of stones. More and more followed. Through the throat of one huge leader Aragorn passed his sword with a thrust; with a great sweep Boromir hewed the head off another. Beside them Gimli stood with his stout legs apart, wielding his dwarf-axe. The bow of Legolas was singing.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 290", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/290"}, "798.0": {"location": "Doors of Moria", "description": "‘What does the writing say?’ asked Frodo, who was trying to decipher the inscription on the arch. ‘I thought I knew the elf-letters, but I cannot read these.’{{break}}‘The words are in the elven-tongue of the West of Middle-earth in the Elder Days,’ answered Gandalf. ‘But they do not say anything of importance to us. They say only: The Doors of Durin, Lord of Moria. Speak, friend, and enter. And underneath small and faint is written: I, Narvi, made them. Celebrimbor of Hollin drew these signs.’{{break}}‘What does it mean by speak, friend, and enter?’ asked Merry.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 297", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/297"}, "818.0": {"location": "Junction of 3 Passages", "description": "It was after nightfall when they had entered the Mines. They had been going for several hours with only brief halts, when Gandalf came to his first serious check. Before him stood a wide dark arch opening into three passages: all led in the same general direction, eastwards; but the left-hand passage plunged down, while the right-hand climbed up, and the middle way seemed to run on, smooth and level but very narrow.{{break}}‘I have no memory of this place at all!’ said Gandalf, standing uncertainly under the arch. He held up his staff in the hope of finding some marks or inscription that might help his choice; but nothing of the kind was to be seen. ‘I am too weary to decide,’ he said, shaking his head. ‘And I expect that you are all as weary as I am, or wearier. We had better halt here for what is left of the night. You know what I mean! In here it is ever dark; but outside the late Moon is riding westward and the middle-night has passed.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 304", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/304"}, "839.5": {"location": "Bridge of Khazad-dum", "description": "The Balrog reached the bridge. Gandalf stood in the middle of the span, leaning on the staff in his left hand, but in his other hand Glamdring gleamed, cold and white. His enemy halted again, facing him, and the shadow about it reached out like two vast wings. It raised the whip, and the thongs whined and cracked. Fire came from its nostrils. But Gandalf stood firm.{{break}}‘You cannot pass,’ he said. The orcs stood still, and a dead silence fell. ‘I am a servant of the Secret Fire, wielder of the flame of Anor. You cannot pass. The dark fire will not avail you, flame of Udûn. Go back to the Shadow! You cannot pass.’{{break}}The Balrog made no answer. The fire in it seemed to die, but the darkness grew. It stepped forward slowly on to the bridge, and suddenly it drew itself up to a great height, and its wings were spread from wall to wall; but still Gandalf could be seen, glimmering in the gloom; he seemed small, and altogether alone: grey and bent, like a wizened tree before the onset of a storm.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 322", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/322"}, "855.0": {"location": "Enter Lothlorien", "description": "The others cast themselves down upon the fragrant grass, but Frodo stood awhile still lost in wonder. It seemed to him that he had stepped through a high window that looked on a vanished world. A light was upon it for which his language had no name. All that he saw was shapely, but the shapes seemed at once clear cut, as if they had been first conceived and drawn at the uncovering of his eyes, and ancient as if they had endured for ever. He saw no colour but those he knew, gold and white and blue and green, but they were fresh and poignant, as if he had at that moment first perceived them and made for them names new and wonderful. In winter here no heart could mourn for summer or for spring. No blemish or sickness or deformity could be seen in anything that grew upon the earth. On the land of Lórien there was no stain.{{break}}He turned and saw that Sam was now standing beside him, looking round with a puzzled expression, and rubbing his eyes as if he was not sure that he was awake. ‘It’s sunlight and bright day, right enough,’ he said. ‘I thought that Elves were all for moon and stars: but this is more Elvish than anything I ever heard tell of. I feel as if I was inside a song, if you take my meaning.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 341", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/341"}, "920.0": {"location": "Caras Galadan", "description": "‘Welcome to Caras Galadhon!’ he said. ‘Here is the city of the Galadhrim where dwell the Lord Celeborn and Galadriel the Lady of Lórien. But we cannot enter here, for the gates do not look northward. We must go round to the southern side, and the way is not short, for the city is great.’{{break}}There was a road paved with white stone running on the outer brink of the fosse. Along this they went westward, with the city ever climbing up like a green cloud upon their left; and as the night deepened more lights sprang forth, until all the hill seemed afire with stars. They came at last to a white bridge, and crossing found the great gates of the city: they faced south-west, set between the ends of the encircling wall that here overlapped, and they were tall and strong, and hung with many lamps.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 344", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/344"}, "987.0": {"location": "2 Days after Lothlorien", "description": "They started again before the day was broad. Not that most of the Company were eager to hurry southwards: they were content that the decision, which they must make at latest when they came to Rauros and the Tindrock Isle, still lay some days ahead; and they let the River bear them on at its own pace, having no desire to hasten towards the perils that lay beyond, whichever course they took in the end. Aragorn let them drift with the stream as they wished, husbanding their strength against weariness to come. But he insisted that at least they should start early each day and journey on far into the evening; for he felt in his heart that time was pressing, and he feared that the Dark Lord had not been idle while they lingered in Lórien.{{break}}Nonetheless they saw no sign of any enemy that day, nor the next. The dull grey hours passed without event.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 371", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/371"}, "1023.0": {"location": "Field of Celebrant", "description": "As the third day of their voyage wore on the lands changed slowly: the trees thinned and then failed altogether. On the eastern bank to their left they saw long formless slopes stretching up and away towards the sky; brown and withered they looked, as if fire had passed over them, leaving no living blade of green: an unfriendly waste without even a broken tree or a bold stone to relieve the emptiness. They had come to the Brown Lands that lay, vast and desolate, between Southern Mirkwood and the hills of the Emyn Muil. What pestilence or war or evil deed of the Enemy had so blasted all that region even Aragorn could not tell.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 371", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/371"}, "1063.0": {"location": "North Undeep", "description": "For a whole day they took to their paddles and hastened forward. The banks slid by. Soon the River broadened and grew more shallow; long stony beaches lay upon the east, and there were gravel-shoals in the water, so that careful steering was needed. The Brown Lands rose into bleak wolds, over which flowed a chill air from the East. On the other side the meads had become rolling downs of withered grass amidst a land of fen and tussock. Frodo shivered, thinking of the lawns and fountains, the clear sun and gentle rains of Lothlórien. There was little speech and no laughter in any of the boats. Each member of the Company was busy with his own thoughts.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 372", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/372"}, "1075.0": {"location": "Sam spots Gollum on Log", "description": "‘Well, what was it?’ said Frodo, knowing that Sam would not settle down until he had told his tale, whatever it was. ‘I haven’t seen or thought of anything to make me smile since we left Lothlórien.’{{break}}‘It wasn’t funny that way, Mr. Frodo. It was queer. All wrong, if it wasn’t a dream. And you had best hear it. It was like this: I saw a log with eyes!’{{break}}‘The log’s all right,’ said Frodo. ‘There are many in the River. But leave out the eyes!’{{break}}‘That I won’t,’ said Sam. ‘’Twas the eyes as made me sit up, so to speak. I saw what I took to be a log floating along in the half-light behind Gimli’s boat; but I didn’t give much heed to it. Then it seemed as if the log was slowly catching us up. And that was peculiar, as you might say, seeing as we were all floating on the stream together. Just then I saw the eyes: two pale sort of points, shiny-like, on a hump at the near end of the log. What’s more, it wasn’t a log, for it had paddle-feet, like a swan’s almost, only they seemed bigger, and kept dipping in and out of the water.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 373", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/373"}, "1122.0": {"location": "South Undeep", "description": "TODO - can't find reference - remove?", "reference": "#", "link": ""}, "1155.0": {"location": "5 Days after Lothlorien", "description": "TODO - can't find reference - remove?", "reference": "#", "link": ""}, "1205.0": {"location": "6 Days after Lothlorien", "description": "The night passed without Gollum showing so much as a shadow again. After that the Company kept a sharp look-out, but they saw no more of Gollum while the voyage lasted. If he was still following, he was very wary and cunning. At Aragorn’s bidding they paddled now for long spells, and the banks went swiftly by. But they saw little of the country, for they journeyed mostly by night and twilight, resting by day, and lying as hidden as the land allowed. In this way the time passed without event until the seventh day.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 375", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/375"}, "1234.0": {"location": "Higher Emyn Muil", "description": "The next day the country on either side began to change rapidly. The banks began to rise and grow stony. Soon they were passing through a hilly rocky land, and on both shores there were steep slopes buried in deep brakes of thorn and sloe, tangled with brambles and creepers. Behind them stood low crumbling cliffs, and chimneys of grey weathered stone dark with ivy; and beyond these again there rose high ridges crowned with wind-writhen firs. They were drawing near to the grey hill-country of the Emyn Muil, the southern march of Wilderland.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 375", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/375"}, "1255.0": {"location": "Legolas sees an eagle (Gandalf)", "description": "There were many birds about the cliffs and the rock-chimneys, and all day high in the air flocks of birds had been circling, black against the pale sky. As they lay in their camp that day Aragorn watched the flights doubtfully, wondering if Gollum had been doing some mischief and the news of their voyage was now moving in the wilderness. Later as the sun was setting, and the Company was stirring and getting ready to start again, he descried a dark spot against the fading light: a great bird high and far off, now wheeling, now flying on slowly southwards.{{break}}‘What is that, Legolas?’ he asked, pointing to the northern sky. ‘Is it, as I think, an eagle?’{{break}}‘Yes,’ said Legolas. ‘It is an eagle, a hunting eagle. I wonder what that forebodes. It is far from the mountains.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 376", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/376"}, "1267.0": {"location": "Orc Attack at Sarn Gebir", "description": "At that moment there was a twang of bowstrings: several arrows whistled over them, and some fell among them. One smote Frodo between the shoulders and he lurched forward with a cry, letting go his paddle: but the arrow fell back, foiled by his hidden coat of mail. Another passed through Aragorn’s hood; and a third stood fast in the gunwale of the second boat, close by Merry’s hand. Sam thought he could glimpse black figures running to and fro upon the long shingle-banks that lay under the eastern shore. They seemed very near.{{break}}‘Yrch!’ said Legolas, falling into his own tongue.{{break}}‘Orcs!’ cried Gimli.{{break}}‘Gollum’s doing, I’ll be bound,’ said Sam to Frodo. ‘And a nice place to choose, too. The River seems set on taking us right into their arms!’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 377", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/377"}, "1288.0": {"location": "The Argonath", "description": "Frodo peering forward saw in the distance two great rocks approaching: like great pinnacles or pillars of stone they seemed. Tall and sheer and ominous they stood upon either side of the stream. A narrow gap appeared between them, and the River swept the boats towards it.{{break}}‘Behold the Argonath, the Pillars of the Kings!’ cried Aragorn. ‘We shall pass them soon. Keep the boats in line, and as far apart as you can! Hold the middle of the stream!’{{break}}As Frodo was borne towards them the great pillars rose like towers to meet him. Giants they seemed to him, vast grey figures silent but threatening. Then he saw that they were indeed shaped and fashioned: the craft and power of old had wrought upon them, and still they preserved through the suns and rains of forgotten years the mighty likenesses in which they had been hewn. Upon great pedestals founded in the deep waters stood two great kings of stone: still with blurred eyes and crannied brows they frowned upon the North. The left hand of each was raised palm outwards in gesture of warning; in each right hand there was an axe; upon each head there was a crumbling helm and crown. Great power and majesty they still wore, the silent wardens of a long-vanished kingdom. Awe and fear fell upon Frodo, and he cowered down, shutting his eyes and not daring to look up as the boat drew near. Even Boromir bowed his head as the boats whirled by, frail and fleeting as little leaves, under the enduring shadow of the sentinels of Númenor. So they passed into the dark chasm of the Gates.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 383", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/383"}, "1309.0": {"location": "Rauros", "description": "‘Behold Tol Brandir!’ said Aragorn, pointing south to the tall peak. ‘Upon the left stands Amon Lhaw, and upon the right is Amon Hen, the Hills of Hearing and of Sight. In the days of the great kings there were high seats upon them, and watch was kept there. But it is said that no foot of man or beast has ever been set upon Tol Brandir. Ere the shade of night falls we shall come to them. I hear the endless voice of Rauros calling.’{{break}}The Company rested now for a while, drifting south on the current that flowed through the middle of the lake. They ate some food, and then they took to their paddles and hastened on their way. The sides of the westward hills fell into shadow, and the Sun grew round and red. Here and there a misty star peered out. The three peaks loomed before them, darkling in the twilight. Rauros was roaring with a great voice. Already night was laid on the flowing waters when the travellers came at last under the shadow of the hills.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 384", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/384"}, "1359.0": {"location": "3 Days after Rauros", "description": "It was the third evening since they had fled from the Company, as far as they could tell: they had almost lost count of the hours during which they had climbed and laboured among the barren slopes and stones of the Emyn Muil, sometimes retracing their steps because they could find no way forward, sometimes discovering that they had wandered in a circle back to where they had been hours before. Yet on the whole they had worked steadily eastward, keeping as near as they could find a way to the outer edge of this strange twisted knot of hills. But always they found its outward faces sheer, high and impassable, frowning over the plain below; beyond its tumbled skirts lay livid festering marshes where nothing moved and not even a bird was to be seen.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 589", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/589"}, "1383.0": {"location": "Capture Gollum", "description": "Things would have gone ill with Sam, if he had been alone. But Frodo sprang up, and drew Sting from its sheath. With his left hand he drew back Gollum’s head by his thin lank hair, stretching his long neck, and forcing his pale venomous eyes to stare up at the sky.{{break}}‘Let go! Gollum,’ he said. ‘This is Sting. You have seen it before once upon a time. Let go, or you’ll feel it this time! I’ll cut your throat.’{{break}}Gollum collapsed and went as loose as wet string. Sam got up, fingering his shoulder. His eyes smouldered with anger, but he could not avenge himself: his miserable enemy lay grovelling on the stones whimpering.{{break}}‘Don’t hurt us! Don’t let them hurt us, precious! They won’t hurt us will they, nice little hobbitses? We didn’t mean no harm, but they jumps on us like cats on poor mices, they did, precious. And we’re so lonely, gollum. We’ll be nice to them, very nice, if they’ll be nice to us, won’t we, yes, yess.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 600", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/600"}, "1411.0": {"location": "Enter Dead Marshes", "description": "On either side and in front wide fens and mires now lay, stretching away southward and eastward into the dim half-light. Mists curled and smoked from dark and noisome pools. The reek of them hung stifling in the still air. Far away, now almost due south, the mountain-walls of Mordor loomed, like a black bar of rugged clouds floating above a dangerous fog-bound sea.{{break}}The hobbits were now wholly in the hands of Gollum. They did not know, and could not guess in that misty light, that they were in fact only just within the northern borders of the marshes, the main expanse of which lay south of them. They could, if they had known the lands, with some delay have retraced their steps a little, and then turning east have come round over hard roads to the bare plain of Dagorlad: the field of the ancient battle before the gates of Mordor. Not that there was great hope in such a course. On that stony plain there was no cover, and across it ran the highways of the Orcs and the soldiers of the Enemy. Not even the cloaks of Lórien would have concealed them there.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 611", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/611"}, "1430.0": {"location": "Nazgul Sighted on Fell Beasts", "description": "They fell forward, grovelling heedlessly on the cold earth. But the shadow of horror wheeled and returned, passing lower now, right above them, sweeping the fen-reek with its ghastly wings. And then it was gone, flying back to Mordor with the speed of the wrath of Sauron; and behind it the wind roared away, leaving the Dead Marshes bare and bleak. The naked waste, as far as the eye could pierce, even to the distant menace of the mountains, was dappled with the fitful moonlight.{{break}}Frodo and Sam got up, rubbing their eyes, like children wakened from an evil dream to find the familiar night still over the world. But Gollum lay on the ground as if he had been stunned. They roused him with difficulty, and for some time he would not lift his face, but knelt forward on his elbows, covering the back of his head with his large flat hands.{{break}}‘Wraiths!’ he wailed. ‘Wraiths on wings! The Precious is their master. They see everything, everything. Nothing can hide from them. Curse the White Face! And they tell Him everything. He sees, He knows. Ach, gollum, gollum, gollum!’ It was not until the moon had sunk, westering far away beyond Tol Brandir, that he would get up or make a move.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 615", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/615"}, "1463.0": {"location": "Desolation of the Morannon", "description": "Across the mouth of the pass, from cliff to cliff, the Dark Lord had built a rampart of stone. In it there was a single gate of iron, and upon its battlement sentinels paced unceasingly. Beneath the hills on either side the rock was bored into a hundred caves and maggot-holes; there a host of orcs lurked, ready at a signal to issue forth like black ants going to war. None could pass the Teeth of Mordor and not feel their bite, unless they were summoned by Sauron, or knew the secret passwords that would open the Morannon, the black gate of his land.{{break}}The two hobbits gazed at the towers and the wall in despair.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 622", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/622"}, "1475.0": {"location": "The Black Gate", "description": "The growing light revealed to them a land already less barren and ruinous. The mountains still loomed up ominously on their left, but near at hand they could see the southward road, now bearing away from the black roots of the hills and slanting westwards. Beyond it were slopes covered with sombre trees like dark clouds, but all about them lay a tumbled heathland, grown with ling and broom and cornel, and other shrubs that they did not know. Here and there they saw knots of tall pine-trees. The hearts of the hobbits rose again a little in spite of weariness: the air was fresh and fragrant, and it reminded them of the uplands of the Northfarthing far away. It seemed good to be reprieved, to walk in a land that had only been for a few years under the dominion of the Dark Lord and was not yet fallen wholly into decay. But they did not forget their danger, nor the Black Gate that was still all too near, hidden though it was behind the gloomy heights. They looked about for a hiding-place where they could shelter from evil eyes while the light lasted.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 634", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/634"}, "1499.0": {"location": "Northern Edge of Ithilien", "description": "So they passed into the northern marches of that land that Men once called Ithilien, a fair country of climbing woods and swift-falling streams. The night became fine under star and round moon, and it seemed to the hobbits that the fragrance of the air grew as they went forward; and from the blowing and muttering of Gollum it seemed that he noticed it too, and did not relish it. At the first signs of day they halted again. They had come to the end of a long cutting, deep, and sheer-sided in the middle, by which the road clove its way through a stony ridge. Now they climbed up the westward bank and looked abroad.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 635", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/635"}, "1523.0": {"location": "Found by Faramir", "description": "‘We have not found what we sought,’ said one. ‘But what have we found?’{{break}}‘Not Orcs,’ said another, releasing the hilt of his sword, which he had seized when he saw the glitter of Sting in Frodo’s hand.{{break}}‘Elves?’ said a third, doubtfully.{{break}}‘Nay! Not Elves,’ said the fourth, the tallest, and as it appeared the chief among them. ‘Elves do not walk in Ithilien in these days. And Elves are wondrous fair to look upon, or so ’tis said.’{{break}}‘Meaning we’re not, I take you,’ said Sam. ‘Thank you kindly. And when you’ve finished discussing us, perhaps you’ll say who you are, and why you can’t let two tired travellers rest.’{{break}}The tall green man laughed grimly. ‘I am Faramir, Captain of Gondor,’ he said. ‘But there are no travellers in this land: only the servants of the Dark Tower, or of the White.’{{break}}‘But we are neither,’ said Frodo. ‘And travellers we are, whatever Captain Faramir may say.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 643", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/643"}, "1533.0": {"location": "Henneth Anun", "description": "They stood on a wet floor of polished stone, the doorstep, as it were, of a rough-hewn gate of rock opening dark behind them. But in front a thin veil of water was hung, so near that Frodo could have put an outstretched arm into it. It faced westward. The level shafts of the setting sun behind beat upon it, and the red light was broken into many flickering beams of ever-changing colour. It was as if they stood at the window of some elven-tower, curtained with threaded jewels of silver and gold, and ruby, sapphire and amethyst, all kindled with an unconsuming fire.{{break}}‘At least by good chance we came at the right hour to reward you for your patience,’ said Faramir. ‘This is the Window of the Sunset, Henneth Annûn, fairest of all the falls of Ithilien, land of many fountains. Few strangers have ever seen it. But there is no kingly hall behind to match it. Enter now and see!’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 658", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/658"}, "1577.0": {"location": "Morgul Vale comes into view", "description": "But no day came, only a dead brown twilight. In the East there was a dull red glare under the lowering cloud: it was not the red of dawn. Across the tumbled lands between, the mountains of the Ephel Dúath frowned at them, black and shapeless below where night lay thick and did not pass away, above with jagged tops and edges outlined hard and menacing against the fiery glow. Away to their right a great shoulder of the mountains stood out, dark and black amid the shadows, thrusting westward.{{break}}‘Which way do we go from here?’ asked Frodo. ‘Is that the opening of – of the Morgul Valley, away over there beyond that black mass?’{{break}}‘Need we think about it yet?’ said Sam. ‘Surely we’re not going to move any more today, if day it is?’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 683", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/683"}, "1590.0": {"location": "The Cross-Roads", "description": "Frodo and Sam were plodding along with heavy hearts, no longer able to care greatly about their peril. Frodo’s head was bowed; his burden was dragging him down again. As soon as the great Cross-roads had been passed, the weight of it, almost forgotten in Ithilien, had begun to grow once more. Now, feeling the way become steep before his feet, he looked wearily up; and then he saw it, even as Gollum had said that he would: the city of the Ringwraiths. He cowered against the stony bank.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 688", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/688"}, "1599.0": {"location": "Top of the Winding Stair", "description": "At length they were once more aware of a wall looming up, and once more a stairway opened before them. Again they halted, and again they began to climb. It was a long and weary ascent; but this stairway did not delve into the mountain-side. Here the huge cliff-face sloped backwards, and the path like a snake wound to and fro across it. At one point it crawled sideways right to the edge of the dark chasm, and Frodo glancing down saw below him as a vast deep pit the great ravine at the head of the Morgul Valley. Down in its depths glimmered like a glow-worm thread the wraith-road from the dead city to the Nameless Pass. He turned hastily away.{{break}}Still on and up the stairway bent and crawled, until at last with a final flight, short and straight, it climbed out again on to another level. The path had veered away from the main pass in the great ravine, and it now followed its own perilous course at the bottom of a lesser cleft among the higher regions of the Ephel Dúath. Dimly the hobbits could discern tall piers and jagged pinnacles of stone on either side, between which were great crevices and fissures blacker than the night, where forgotten winters had gnawed and carved the sunless stone.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 694", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/694"}, "1600.0": {"location": "Shelob's Lair", "description": "Darker it loomed, and steadily it rose as they approached, until it towered up high above them, shutting out the view of all that lay beyond. Deep shadow lay before its feet. Sam sniffed the air.{{break}}‘Ugh! That smell!’ he said. ‘It’s getting stronger and stronger.’{{break}}Presently they were under the shadow, and there in the midst of it they saw the opening of a cave. ‘This is the way in,’ said Gollum softly. ‘This is the entrance to the tunnel.’ He did not speak its name: Torech Ungol, Shelob’s Lair. Out of it came a stench, not the sickly odour of decay in the meads of Morgul, but a foul reek, as if filth unnameable were piled and hoarded in the dark within.{{break}}‘Is this the only way, Sméagol?’ said Frodo.{{break}}‘Yes, yes,’ he answered. ‘Yes, we must go this way now.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 701", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/701"}, "1612.0": {"location": "Frodo stung by Shelob", "description": "‘Master, dear master,’ he said, but Frodo did not speak. As he had run forward, eager, rejoicing to be free, Shelob with hideous speed had come behind and with one swift stroke had stung him in the neck. He lay now pale, and heard no voice, and did not move.{{break}}‘Master, dear master!’ said Sam, and through a long silence waited, listening in vain.{{break}}Then as quickly as he could he cut away the binding cords and laid his head upon Frodo’s breast and to his mouth, but no stir of life could he find, nor feel the faintest flutter of the heart. Often he chafed his master’s hands and feet, and touched his brow, but all were cold.{{break}}‘Frodo, Mr. Frodo!’ he called. ‘Don’t leave me here alone! It’s your Sam calling. Don’t go where I can’t follow! Wake up, Mr. Frodo! O wake up, Frodo, me dear, me dear. Wake up!’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 713", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/713"}, "1617.0": {"location": "Tower of Cirith Ungol", "description": "In that dreadful light Sam stood aghast, for now, looking to his left, he could see the Tower of Cirith Ungol in all its strength. The horn that he had seen from the other side was only its topmost turret. Its eastern face stood up in three great tiers from a shelf in the mountain-wall far below; its back was to a great cliff behind, from which it jutted out in pointed bastions, one above the other, diminishing as they rose, with sheer sides of cunning masonry that looked north-east and south-east. About the lowest tier, two hundred feet below where Sam now stood, there was a battlemented wall enclosing a narrow court. Its gate, upon the near south-eastern side, opened on a broad road, the outer parapet of which ran upon the brink of a precipice, until it turned southward and went winding down into the darkness to join the road that came over the Morgul Pass. Then on it went through a jagged rift in the Morgai out into the valley of Gorgoroth and away to Barad-dûr. The narrow upper way on which Sam stood leapt swiftly down by stair and steep path to meet the main road under the frowning walls close to the Tower-gate.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 879", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/879"}, "1633.0": {"location": "Sam sees a Star", "description": "‘Now you go to sleep first, Mr. Frodo,’ he said. ‘It’s getting dark again. I reckon this day is nearly over.’{{break}}Frodo sighed and was asleep almost before the words were spoken. Sam struggled with his own weariness, and he took Frodo’s hand; and there he sat silent till deep night fell. Then at last, to keep himself awake, he crawled from the hiding-place and looked out. The land seemed full of creaking and cracking and sly noises, but there was no sound of voice or of foot. Far above the Ephel Dúath in the West the night-sky was still dim and pale. There, peeping among the cloud-wrack above a dark tor high up in the mountains, Sam saw a white star twinkle for a while. The beauty of it smote his heart, as he looked up out of the forsaken land, and hope returned to him. For like a shaft, clear and cold, the thought pierced him that in the end the Shadow was only a small and passing thing: there was light and high beauty for ever beyond its reach. His song in the Tower had been defiance rather than hope; for then he was thinking of himself. Now, for a moment, his own fate, and even his master’s, ceased to trouble him. He crawled back into the brambles and laid himself by Frodo’s side, and putting away all fear he cast himself into a deep untroubled sleep.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 901", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/901"}, "1660.0": {"location": "Finish Faramir's Food", "description": "Even if all goes well, I could hardly reach the Mountain in a week. I am afraid, Sam, that the burden will get very heavy, and I shall go still slower as we get nearer.’{{break}}Sam sighed. ‘That’s just as I feared,’ he said. ‘Well, to say nothing of water, we’ve got to eat less, Mr. Frodo, or else move a bit quicker, at any rate while we’re still in this valley. One more bite and all the food’s ended, save the Elves’ waybread.’{{break}}‘I’ll try and be a bit quicker, Sam,’ said Frodo, drawing a deep breath. ‘Come on then! Let’s start another march!’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 906", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/906"}, "1685.0": {"location": "Sam Spots Gollum", "description": "Sam crept out, and flitting from stone to stone with more than hobbit-care, he went down to the water-course, and then followed it for some way as it climbed north, until he came to the rock-steps where long ago, no doubt, its spring had come gushing down in a little waterfall. All now seemed dry and silent; but refusing to despair Sam stooped and listened, and to his delight he caught the sound of trickling. Clambering a few steps up he found a tiny stream of dark water that came out from the hill-side and filled a little bare pool, from which again it spilled, and vanished then under the barren stones.{{break}}Sam tasted the water, and it seemed good enough. Then he drank deeply, refilled the bottle, and turned to go back. At that moment he caught a glimpse of a black form or shadow flitting among the rocks away near Frodo’s hiding-place. Biting back a cry, he leapt down from the spring and ran, jumping from stone to stone. It was a wary creature, difficult to see, but Sam had little doubt about it: he longed to get his hands on its neck. But it heard him coming and slipped quickly away. Sam thought he saw a last fleeting glimpse of it, peering back over the edge of the eastward precipice, before it ducked and disappeared.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 907", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/907"}, "1697.0": {"location": "Sam and Frodo Join Orc March", "description": "Sam held his breath. Now more than half the line had gone by. Then suddenly one of the slave-drivers spied the two figures by the road-side. He flicked a whip at them and yelled: ‘Hi, you! Get up!’ They did not answer, and with a shout he halted the whole company.{{break}}‘Come on, you slugs!’ he cried. ‘This is no time for slouching.’ He took a step towards them, and even in the gloom he recognized the devices on their shields. ‘Deserting, eh?’ he snarled. ‘Or thinking of it? All your folk should have been inside Udûn before yesterday evening. You know that. Up you get and fall in, or I’ll have your numbers and report you.’{{break}}They struggled to their feet, and keeping bent, limping like footsore soldiers, they shuffled back towards the rear of the line. ‘No, not at the rear!’ the slave-driver shouted. ‘Three files up. And stay there, or you’ll know it, when I come down the line!’ He sent his long whip-lash cracking over their heads; then with another crack and a yell he started the company off again at a brisk trot.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 909", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/909"}, "1705.0": {"location": "Sam and Frodo Escape Orcs", "description": "So it chanced that several companies came together at the road-meeting, in the dark beyond the light of the watch-fires on the wall. At once there was great jostling and cursing as each troop tried to get first to the gate and the ending of their march. Though the drivers yelled and plied their whips, scuffles broke out and some blades were drawn. A troop of heavy-armed uruks from Barad-dûr charged into the Durthang line and threw them into confusion.{{break}}Dazed as he was with pain and weariness, Sam woke up, grasped quickly at his chance, and threw himself to the ground, dragging Frodo down with him. Orcs fell over them, snarling and cursing. Slowly on hand and knee the hobbits crawled away out of the turmoil, until at last unnoticed they dropped over the further edge of the road. It had a high kerb by which troop-leaders could guide themselves in black night or fog, and it was banked up some feet above the level of the open land.{{break}}They lay still for a while. It was too dark to seek for cover, if indeed there was any to find; but Sam felt that they ought at least to get further away from the highways and out of the range of torchlight.{{break}}‘Come on, Mr. Frodo!’ he whispered. ‘One more crawl, and then you can lie still.’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 910", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/910"}, "1760.0": {"location": "The Dreadful Nightfall", "description": "There came at last a dreadful nightfall; and even as the Captains of the West drew near to the end of the living lands, the two wanderers came to an hour of blank despair. Four days had passed since they had escaped from the orcs, but the time lay behind them like an ever-darkening dream. All this last day Frodo had not spoken, but had walked half-bowed, often stumbling, as if his eyes no longer saw the way before his feet. Sam guessed that among all their pains he bore the worst, the growing weight of the Ring, a burden on the body and a torment to his mind. Anxiously Sam had noted how his master’s left hand would often be raised as if to ward off a blow, or to screen his shrinking eyes from a dreadful Eye that sought to look in them. And sometimes his right hand would creep to his breast, clutching, and then slowly, as the will recovered mastery, it would be withdrawn.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 914", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/914"}, "1780.0": {"location": "Foot of Mount Doom", "description": "The Mountain crept up ever nearer, until, if they lifted their heavy heads, it filled all their sight, looming vast before them: a huge mass of ash and slag and burned stone, out of which a sheer-sided cone was raised into the clouds. Before the daylong dusk ended and true night came again they had crawled and stumbled to its very feet.{{break}}With a gasp Frodo cast himself on the ground. Sam sat by him. To his surprise he felt tired but lighter, and his head seemed clear again. No more debates disturbed his mind. He knew all the arguments of despair and would not listen to them. His will was set, and only death would break it. He felt no longer either desire or need of sleep, but rather of watchfulness. He knew that all the hazards and perils were now drawing together to a point: the next day would be a day of doom, the day of final effort or disaster, the last gasp.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 919", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/919"}, "1784.0": {"location": "Ring Destroyed", "description": "He groped forward, and then he saw a strange and terrible thing. Gollum on the edge of the abyss was fighting like a mad thing with an unseen foe. To and fro he swayed, now so near the brink that almost he tumbled in, now dragging back, falling to the ground, rising, and falling again. And all the while he hissed but spoke no words.{{break}}The fires below awoke in anger, the red light blazed, and all the cavern was filled with a great glare and heat. Suddenly Sam saw Gollum’s long hands draw upwards to his mouth; his white fangs gleamed, and then snapped as they bit. Frodo gave a cry, and there he was, fallen upon his knees at the chasm’s edge. But Gollum, dancing like a mad thing, held aloft the ring, a finger still thrust within its circle. It shone now as if verily it was wrought of living fire.{{break}}‘Precious, precious, precious!’ Gollum cried. ‘My Precious! O my Precious!’ And with that, even as his eyes were lifted up to gloat on his prize, he stepped too far, toppled, wavered for a moment on the brink, and then with a shriek he fell. Out of the depths came his last wail Precious, and he was gone.{{break}}There was a roar and a great confusion of noise. Fires leaped up and licked the roof. The throbbing grew to a great tumult, and the Mountain shook. Sam ran to Frodo and picked him up and carried him out to the door.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 925", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/925"}, "1786.0": {"location": "Outside Mount Doom", "description": "‘Well, Master, we could at least go further from this dangerous place here, from this Crack of Doom, if that’s its name. Now couldn’t we? Come, Mr. Frodo, let’s go down the path at any rate!’{{break}}‘Very well, Sam. If you wish to go, I’ll come,’ said Frodo; and they rose and went slowly down the winding road; and even as they passed towards the Mountain’s quaking feet, a great smoke and steam belched from the Sammath Naur, and the side of the cone was riven open, and a huge fiery vomit rolled in slow thunderous cascade down the eastern mountain-side.{{break}}Frodo and Sam could go no further. Their last strength of mind and body was swiftly ebbing. They had reached a low ashen hill piled at the Mountain’s foot; but from it there was no more escape. It was an island now, not long to endure, amid the torment of Orodruin. All about it the earth gaped, and from deep rifts and pits smoke and fumes leaped up. Behind them the Mountain was convulsed. Great rents opened in its side. Slow rivers of fire came down the long slopes towards them. Soon they would be engulfed. A rain of hot ash was falling.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 929", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/929"}, "1786.5": {"location": "The Morannon", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "1810.0": {"location": "Northern Edge of Ithilien", "description": "Full memory flooded back, and Sam cried aloud: ‘It wasn’t a dream! Then where are we?’{{break}}And a voice spoke softly behind him: ‘In the land of Ithilien, and in the keeping of the King; and he awaits you.’ With that Gandalf stood before him, robed in white, his beard now gleaming like pure snow in the twinkling of the leafy sunlight. ‘Well, Master Samwise, how do you feel?’ he said.{{break}}But Sam lay back, and stared with open mouth, and for a moment, between bewilderment and great joy, he could not answer. At last he gasped: ‘Gandalf! I thought you were dead! But then I thought I was dead myself. Is everything sad going to come untrue? What’s happened to the world?’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 930", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/930"}, "1842.0": {"location": "Camp Near Henneth Anun", "description": "Then the others also departed, and Frodo and Sam went to their beds and slept. And in the morning they rose again in hope and peace; and they spent many days in Ithilien. For the Field of Cormallen, where the host was now encamped, was near to Henneth Annûn, and the stream that flowed from its falls could be heard in the night as it rushed down through its rocky gate, and passed through the flowery meads into the tides of Anduin by the Isle of Cair Andros. The hobbits wandered here and there visiting again the places that they had passed before; and Sam hoped always in some shadow of the woods or secret glade to catch, maybe, a glimpse of the great Oliphaunt. And when he learned that at the siege of Gondor there had been a great number of these beasts but that they were all destroyed, he thought it a sad loss.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 936", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/936"}, "1854.0": {"location": "Field of Cormallen", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "1893.0": {"location": "Osgiliath", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "1906.0": {"location": "Minas Tirith", "description": "The hobbits still remained in Minas Tirith, with Legolas and Gimli; for Aragorn was loth for the fellowship to be dissolved. ‘At last all such things must end,’ he said, ‘but I would have you wait a little while longer: for the end of the deeds that you have shared in has not yet come. A day draws near that I have looked for in all the years of my manhood, and when it comes I would have my friends beside me.’ But of that day he would say no more.{{break}}In those days the Companions of the Ring dwelt together in a fair house with Gandalf, and they went to and fro as they wished.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 948", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/948"}, "1916.0": {"location": "Rammas Echor", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "1932.0": {"location": "Grey Wood", "description": "For the other Companions steeds were furnished according to their stature; and Frodo and Samwise rode at Aragorn’s side, and Gandalf rode upon Shadowfax, and Pippin rode with the knights of Gondor; and Legolas and Gimli as ever rode together upon Arod.{{break}}In that riding went also Queen Arwen, and Celeborn and Galadriel with their folk, and Elrond and his sons; and the princes of Dol Amroth and of Ithilien, and many captains and knights. Never had any king of the Mark such company upon the road as went with Théoden Thengel’s son to the land of his home.{{break}}Without haste and at peace they passed into Anórien, and they came to the Grey Wood under Amon Dîn; and there they heard a sound as of drums beating in the hills, though no living thing could be seen. Then Aragorn let the trumpets be blown; and heralds cried:{{break}}‘Behold, the King Elessar is come! The Forest of Drúadan he gives to Ghân-buri-Ghân and to his folk, to be their own for ever; and hereafter let no man enter it without their leave!’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 953", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/953"}, "1951.0": {"location": "North of Amon Din", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "1979.0": {"location": "North of Eilenach", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2007.0": {"location": "Nardol", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2026.0": {"location": "North of Erelas", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2043.0": {"location": "North of Rimmon", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2058.0": {"location": "Minrimmon", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2087.0": {"location": "Calenhad", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2108.0": {"location": "Firien Wood", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2119.0": {"location": "Halifrien", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2130.0": {"location": "Cross Mering Stream", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2146.0": {"location": "Exit Firien Wood", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2166.0": {"location": "Enter the Folde", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2213.0": {"location": "Leave the Folde", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2251.0": {"location": "Foothills of Irensaga", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2266.0": {"location": "Edoras", "description": "At length after fifteen days of journey the wain of King Théoden passed through the green fields of Rohan and came to Edoras; and there they all rested. The Golden Hall was arrayed with fair hangings and it was filled with light, and there was held the highest feast that it had known since the days of its building. For after three days the Men of the Mark prepared the funeral of Théoden; and he was laid in a house of stone with his arms and many other fair things that he had possessed, and over him was raised a great mound, covered with green turves of grass and of white evermind. And now there were eight mounds on the east-side of the Barrowfield.", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 954", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/954"}, "2290.0": {"location": "Head to Helm's Deep, camp.", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2314.0": {"location": "Camp", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2338.0": {"location": "Camp", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2362.0": {"location": "Camp", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2385.0": {"location": "Helm's Deep", "description": "Now the guests were ready, and they drank the stirrup-cup, and with great praise and friendship they departed, and came at length to Helm’s Deep, and there they rested two days. Then Legolas repaid his promise to Gimli and went with him to the Glittering Caves; and when they returned he was silent, and would say only that Gimli alone could find fit words to speak of them. ‘And never before has a Dwarf claimed a victory over an Elf in a contest of words,’ said he. ‘Now therefore let us go to Fangorn and set the score right!’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 956", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/956"}, "2410.0": {"location": "Cross Fords of Isen", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2427.0": {"location": "Wizard's Vale", "description": "TODO - can't find reference, remove?", "reference": "#", "link": ""}, "2441.0": {"location": "Treegarth of Orthanc", "description": "For a while the travellers sat where once the old gates of Isengard had stood, and there were now two tall trees like sentinels at the beginning of a green-bordered path that ran towards Orthanc; and they looked in wonder at the work that had been done, but no living thing could they see far or near. But presently they heard a voice calling hoom-hom, hoom-hom; and there came Treebeard striding down the path to greet them with Quickbeam at his side.{{break}}‘Welcome to the Treegarth of Orthanc!’ he said. ‘I knew that you were coming, but I was at work up the valley; there is much still to be done. But you have not been idle either away in the south and the east, I hear; and all that I hear is good, very good.’ Then Treebeard praised all their deeds, of which he seemed to have full knowledge; and at last he stopped and looked long at Gandalf.{{break}}‘Well, come now!’ he said. ‘You have proved mightiest, and all your labours have gone well. Where now would you be going? And why do you come here?’", "reference": "J. R. R. Tolkien, The Lord of the Rings (New York, NY: Houghton Mifflin Company, 2001), p. 956", "link": "https://archive.org/details/lordofrings0000tolk_b2r2/page/956"}}